/**
 * Created by shunya on 01.12.2017.
 */
public class Example {                             //public, поскольку при выполнении программы он вызывается за пределами своего класса.
  public static void main (String args[]){         //static допускает вызов метода main () до создания объекта класса
    System.out.println("Java drives the Web");     // void лишь сообщает компилятору о том, что метод main () не возвращает значение.
  }                                                //  String args[]) это пустой массив
}                                                  //System — это предопределенный класс, предоставляю¬щий доступ к системным ресурсам, a out — поток вывода на консоль.
                                                  // Таким образом,ystem, out — это объек^ инкапсулирующий вывод на консоль.
